In [2]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [3]:
engine = create_engine('sqlite:///../data/raw/Albrodmar.db')

In [4]:
df_business = pd.read_sql_query("SELECT * FROM business_info", engine)

In [5]:
df_business.describe()

                id   Unnamed: 0  realTimePosition
count  2208.000000  2208.000000       2208.000000
mean   5536.576993  1155.500000       1102.043478
std    2569.506695   637.539018        630.218047
min    1000.000000    52.000000          1.000000
25%    3372.750000   603.750000        555.750000
50%    5551.500000  1155.500000       1106.500000
75%    7691.750000  1707.250000       1655.250000
max    9997.000000  2259.000000       2153.000000

In [6]:
df_business.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 7 columns):
id                  2208 non-null int64
Unnamed: 0          2208 non-null int64
Source              2208 non-null object
worth               2208 non-null object
worthChange         2208 non-null object
realTimeWorth       0 non-null object
realTimePosition    2208 non-null int64
dtypes: int64(3), object(4)
memory usage: 120.9+ KB

In [7]:
df_business.head()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,5390,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,1675,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,2361,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,2340,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,6891,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5

In [8]:
len(df_business)

2208

In [11]:
df_business.isnull().sum()/len(df_business)*100

id                    0.0
Unnamed: 0            0.0
Source                0.0
worth                 0.0
worthChange           0.0
realTimeWorth       100.0
realTimePosition      0.0
dtype: float64

In [13]:
df_business.shape

(2208, 7)

In [16]:
df_business.dtypes

id                   int64
Unnamed: 0           int64
Source              object
worth               object
worthChange         object
realTimeWorth       object
realTimePosition     int64
dtype: object